Data/TestFiles/cases/DamBreak3D/case/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{

    open
    {
        type        inletOutlet;
        inletValue  uniform 0.0;
        value       $internalField;
    }

    wall
    {
        type        zeroGradient;
    }

    defaultFaces
    {
        type        zeroGradient;
    }

}

// ************************************************************************* //
