Data/TestFiles/cases/DamBreak3D/case/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
    {
        name open;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_1_.*" );
    }

    {
        name wall;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches ( "patch_2_.*" );
    }

    {
        name defaultFaces;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches ( "patch_0_0" "patch_0_1" );
    }


);


// ************************************************************************* //
